name: "M1"
platform: "tensorrt_plan"
max_batch_size: 1
input [
  {
    name: "input_tensor"
    data_type: TYPE_FP32
    dims: [ -1, 1 ]
  }
]
output [
  {
    name: "output_tensor"
    data_type: TYPE_FP32
    dims: [ -1, 1 ]
  }
]